In [ ]:
import pandas as pd

In [ ]:
df=pd.read_excel('/content/2019 Winter Data Science Intern Challenge Data Set.xlsx')
df.head()

   order_id  shop_id  ...  payment_method              created_at
0         1       53  ...            cash 2017-03-13 12:36:56.190
1         2       92  ...            cash 2017-03-03 17:38:51.999
2         3       44  ...            cash 2017-03-14 04:23:55.595
3         4       18  ...     credit_card 2017-03-26 12:43:36.649
4         5       18  ...     credit_card 2017-03-01 04:35:10.773

[5 rows x 7 columns]

In [ ]:
df.describe()

          order_id      shop_id      user_id   order_amount  total_items
count  5000.000000  5000.000000  5000.000000    5000.000000   5000.00000
mean   2500.500000    50.078800   849.092400    3145.128000      8.78720
std    1443.520003    29.006118    87.798982   41282.539349    116.32032
min       1.000000     1.000000   607.000000      90.000000      1.00000
25%    1250.750000    24.000000   775.000000     163.000000      1.00000
50%    2500.500000    50.000000   849.000000     284.000000      2.00000
75%    3750.250000    75.000000   925.000000     390.000000      3.00000
max    5000.000000   100.000000   999.000000  704000.000000   2000.00000

In [ ]:
df['order_amount'].sum()/df['order_amount'].count()

3145.128

normally we calculate average by taking the total sum of the all the data values by total num of data points. 
After applying Describe to our dataframe, it looks like AOV is calculated just by how Describe works which is by taking sum of all the data points and dividing by total values in the same column.
However, Average Order Value is calculated by :


>  **Total store revenue / total number of orders**


Thus we need to calculate AOV as:


> **total order_amount/sum of total_iteams**

In [ ]:
df['order_amount'].sum()/df['total_items'].sum()

357.92152221412965